{"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "zero_padding2d_35", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_35", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "conv2d_346", "class_name": "Conv2D", "config": {"name": "conv2d_346", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_35", 0, 0, {}]]]}, {"name": "batch_normalization_346", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_346", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_346", 0, 0, {}]]]}, {"name": "activation_345", "class_name": "Activation", "config": {"name": "activation_345", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_346", 0, 0, {}]]]}, {"name": "conv2d_347", "class_name": "Conv2D", "config": {"name": "conv2d_347", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_345", 0, 0, {}]]]}, {"name": "batch_normalization_347", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_347", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_347", 0, 0, {}]]]}, {"name": "activation_346", "class_name": "Activation", "config": {"name": "activation_346", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_347", 0, 0, {}]]]}, {"name": "conv2d_348", "class_name": "Conv2D", "config": {"name": "conv2d_348", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_346", 0, 0, {}]]]}, {"name": "batch_normalization_348", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_348", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_348", 0, 0, {}]]]}, {"name": "add_167", "class_name": "Add", "config": {"name": "add_167", "trainable": true}, "inbound_nodes": [[["batch_normalization_348", 0, 0, {}], ["activation_345", 0, 0, {}]]]}, {"name": "activation_347", "class_name": "Activation", "config": {"name": "activation_347", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_167", 0, 0, {}]]]}, {"name": "conv2d_349", "class_name": "Conv2D", "config": {"name": "conv2d_349", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_347", 0, 0, {}]]]}, {"name": "batch_normalization_349", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_349", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_349", 0, 0, {}]]]}, {"name": "activation_348", "class_name": "Activation", "config": {"name": "activation_348", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_349", 0, 0, {}]]]}, {"name": "conv2d_350", "class_name": "Conv2D", "config": {"name": "conv2d_350", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_348", 0, 0, {}]]]}, {"name": "batch_normalization_350", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_350", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_350", 0, 0, {}]]]}, {"name": "add_168", "class_name": "Add", "config": {"name": "add_168", "trainable": true}, "inbound_nodes": [[["batch_normalization_350", 0, 0, {}], ["activation_347", 0, 0, {}]]]}, {"name": "activation_349", "class_name": "Activation", "config": {"name": "activation_349", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_168", 0, 0, {}]]]}, {"name": "conv2d_351", "class_name": "Conv2D", "config": {"name": "conv2d_351", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_349", 0, 0, {}]]]}, {"name": "batch_normalization_351", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_351", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_351", 0, 0, {}]]]}, {"name": "activation_350", "class_name": "Activation", "config": {"name": "activation_350", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_351", 0, 0, {}]]]}, {"name": "conv2d_352", "class_name": "Conv2D", "config": {"name": "conv2d_352", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_350", 0, 0, {}]]]}, {"name": "batch_normalization_352", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_352", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_352", 0, 0, {}]]]}, {"name": "add_169", "class_name": "Add", "config": {"name": "add_169", "trainable": true}, "inbound_nodes": [[["batch_normalization_352", 0, 0, {}], ["activation_349", 0, 0, {}]]]}, {"name": "activation_351", "class_name": "Activation", "config": {"name": "activation_351", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_169", 0, 0, {}]]]}, {"name": "conv2d_353", "class_name": "Conv2D", "config": {"name": "conv2d_353", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_351", 0, 0, {}]]]}, {"name": "batch_normalization_353", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_353", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_353", 0, 0, {}]]]}, {"name": "activation_352", "class_name": "Activation", "config": {"name": "activation_352", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_353", 0, 0, {}]]]}, {"name": "conv2d_354", "class_name": "Conv2D", "config": {"name": "conv2d_354", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_352", 0, 0, {}]]]}, {"name": "batch_normalization_354", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_354", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_354", 0, 0, {}]]]}, {"name": "add_170", "class_name": "Add", "config": {"name": "add_170", "trainable": true}, "inbound_nodes": [[["batch_normalization_354", 0, 0, {}], ["activation_351", 0, 0, {}]]]}, {"name": "activation_353", "class_name": "Activation", "config": {"name": "activation_353", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_170", 0, 0, {}]]]}, {"name": "conv2d_355", "class_name": "Conv2D", "config": {"name": "conv2d_355", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_353", 0, 0, {}]]]}, {"name": "batch_normalization_355", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_355", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_355", 0, 0, {}]]]}, {"name": "activation_354", "class_name": "Activation", "config": {"name": "activation_354", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_355", 0, 0, {}]]]}, {"name": "conv2d_356", "class_name": "Conv2D", "config": {"name": "conv2d_356", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_354", 0, 0, {}]]]}, {"name": "batch_normalization_356", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_356", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_356", 0, 0, {}]]]}, {"name": "add_171", "class_name": "Add", "config": {"name": "add_171", "trainable": true}, "inbound_nodes": [[["batch_normalization_356", 0, 0, {}], ["activation_353", 0, 0, {}]]]}, {"name": "activation_355", "class_name": "Activation", "config": {"name": "activation_355", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_171", 0, 0, {}]]]}, {"name": "zero_padding2d_36", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_36", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_355", 0, 0, {}]]]}, {"name": "conv2d_357", "class_name": "Conv2D", "config": {"name": "conv2d_357", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_36", 0, 0, {}]]]}, {"name": "batch_normalization_357", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_357", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_357", 0, 0, {}]]]}, {"name": "activation_356", "class_name": "Activation", "config": {"name": "activation_356", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_357", 0, 0, {}]]]}, {"name": "conv2d_358", "class_name": "Conv2D", "config": {"name": "conv2d_358", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_356", 0, 0, {}]]]}, {"name": "max_pooling2d_23", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_355", 0, 0, {}]]]}, {"name": "batch_normalization_358", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_358", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_358", 0, 0, {}]]]}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "function": ["4wEAAAAAAAAAAgAAAAQAAABDAAAAcxwAAAB0AGoBfACDAX0BdABqAnwAfAFnAmQBZAKNAlMAKQNO\n6QMAAAApAdoEYXhpcykD2gFL2gp6ZXJvc19saWtl2gtjb25jYXRlbmF0ZSkC2gF42gF5qQByCAAA\nAPolQzovVXNlcnMvQy9EZXNrdG9wL3Jlc25ldDUwLWxpdHRsZS5wedoHemVyb3BhZEwAAABzBAAA\nAAABCgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"name": "add_172", "class_name": "Add", "config": {"name": "add_172", "trainable": true}, "inbound_nodes": [[["batch_normalization_358", 0, 0, {}], ["lambda_23", 0, 0, {}]]]}, {"name": "activation_357", "class_name": "Activation", "config": {"name": "activation_357", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_172", 0, 0, {}]]]}, {"name": "conv2d_359", "class_name": "Conv2D", "config": {"name": "conv2d_359", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_357", 0, 0, {}]]]}, {"name": "batch_normalization_359", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_359", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_359", 0, 0, {}]]]}, {"name": "activation_358", "class_name": "Activation", "config": {"name": "activation_358", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_359", 0, 0, {}]]]}, {"name": "conv2d_360", "class_name": "Conv2D", "config": {"name": "conv2d_360", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_358", 0, 0, {}]]]}, {"name": "batch_normalization_360", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_360", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_360", 0, 0, {}]]]}, {"name": "add_173", "class_name": "Add", "config": {"name": "add_173", "trainable": true}, "inbound_nodes": [[["batch_normalization_360", 0, 0, {}], ["activation_357", 0, 0, {}]]]}, {"name": "activation_359", "class_name": "Activation", "config": {"name": "activation_359", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_173", 0, 0, {}]]]}, {"name": "conv2d_361", "class_name": "Conv2D", "config": {"name": "conv2d_361", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_359", 0, 0, {}]]]}, {"name": "batch_normalization_361", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_361", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_361", 0, 0, {}]]]}, {"name": "activation_360", "class_name": "Activation", "config": {"name": "activation_360", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_361", 0, 0, {}]]]}, {"name": "conv2d_362", "class_name": "Conv2D", "config": {"name": "conv2d_362", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_360", 0, 0, {}]]]}, {"name": "batch_normalization_362", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_362", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_362", 0, 0, {}]]]}, {"name": "add_174", "class_name": "Add", "config": {"name": "add_174", "trainable": true}, "inbound_nodes": [[["batch_normalization_362", 0, 0, {}], ["activation_359", 0, 0, {}]]]}, {"name": "activation_361", "class_name": "Activation", "config": {"name": "activation_361", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_174", 0, 0, {}]]]}, {"name": "conv2d_363", "class_name": "Conv2D", "config": {"name": "conv2d_363", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_361", 0, 0, {}]]]}, {"name": "batch_normalization_363", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_363", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_363", 0, 0, {}]]]}, {"name": "activation_362", "class_name": "Activation", "config": {"name": "activation_362", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_363", 0, 0, {}]]]}, {"name": "conv2d_364", "class_name": "Conv2D", "config": {"name": "conv2d_364", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_362", 0, 0, {}]]]}, {"name": "batch_normalization_364", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_364", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_364", 0, 0, {}]]]}, {"name": "add_175", "class_name": "Add", "config": {"name": "add_175", "trainable": true}, "inbound_nodes": [[["batch_normalization_364", 0, 0, {}], ["activation_361", 0, 0, {}]]]}, {"name": "activation_363", "class_name": "Activation", "config": {"name": "activation_363", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_175", 0, 0, {}]]]}, {"name": "conv2d_365", "class_name": "Conv2D", "config": {"name": "conv2d_365", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_363", 0, 0, {}]]]}, {"name": "batch_normalization_365", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_365", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_365", 0, 0, {}]]]}, {"name": "activation_364", "class_name": "Activation", "config": {"name": "activation_364", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_365", 0, 0, {}]]]}, {"name": "conv2d_366", "class_name": "Conv2D", "config": {"name": "conv2d_366", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_364", 0, 0, {}]]]}, {"name": "batch_normalization_366", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_366", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_366", 0, 0, {}]]]}, {"name": "add_176", "class_name": "Add", "config": {"name": "add_176", "trainable": true}, "inbound_nodes": [[["batch_normalization_366", 0, 0, {}], ["activation_363", 0, 0, {}]]]}, {"name": "activation_365", "class_name": "Activation", "config": {"name": "activation_365", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_176", 0, 0, {}]]]}, {"name": "zero_padding2d_37", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_37", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_365", 0, 0, {}]]]}, {"name": "conv2d_367", "class_name": "Conv2D", "config": {"name": "conv2d_367", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_37", 0, 0, {}]]]}, {"name": "batch_normalization_367", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_367", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_367", 0, 0, {}]]]}, {"name": "activation_366", "class_name": "Activation", "config": {"name": "activation_366", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_367", 0, 0, {}]]]}, {"name": "conv2d_368", "class_name": "Conv2D", "config": {"name": "conv2d_368", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_366", 0, 0, {}]]]}, {"name": "max_pooling2d_24", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_365", 0, 0, {}]]]}, {"name": "batch_normalization_368", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_368", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_368", 0, 0, {}]]]}, {"name": "lambda_24", "class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "function": ["4wEAAAAAAAAAAgAAAAQAAABDAAAAcxwAAAB0AGoBfACDAX0BdABqAnwAfAFnAmQBZAKNAlMAKQNO\n6QMAAAApAdoEYXhpcykD2gFL2gp6ZXJvc19saWtl2gtjb25jYXRlbmF0ZSkC2gF42gF5qQByCAAA\nAPolQzovVXNlcnMvQy9EZXNrdG9wL3Jlc25ldDUwLWxpdHRsZS5wedoHemVyb3BhZEwAAABzBAAA\nAAABCgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]]}, {"name": "add_177", "class_name": "Add", "config": {"name": "add_177", "trainable": true}, "inbound_nodes": [[["batch_normalization_368", 0, 0, {}], ["lambda_24", 0, 0, {}]]]}, {"name": "activation_367", "class_name": "Activation", "config": {"name": "activation_367", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_177", 0, 0, {}]]]}, {"name": "conv2d_369", "class_name": "Conv2D", "config": {"name": "conv2d_369", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_367", 0, 0, {}]]]}, {"name": "batch_normalization_369", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_369", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_369", 0, 0, {}]]]}, {"name": "activation_368", "class_name": "Activation", "config": {"name": "activation_368", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_369", 0, 0, {}]]]}, {"name": "conv2d_370", "class_name": "Conv2D", "config": {"name": "conv2d_370", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_368", 0, 0, {}]]]}, {"name": "batch_normalization_370", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_370", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_370", 0, 0, {}]]]}, {"name": "add_178", "class_name": "Add", "config": {"name": "add_178", "trainable": true}, "inbound_nodes": [[["batch_normalization_370", 0, 0, {}], ["activation_367", 0, 0, {}]]]}, {"name": "activation_369", "class_name": "Activation", "config": {"name": "activation_369", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_178", 0, 0, {}]]]}, {"name": "conv2d_371", "class_name": "Conv2D", "config": {"name": "conv2d_371", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_369", 0, 0, {}]]]}, {"name": "batch_normalization_371", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_371", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_371", 0, 0, {}]]]}, {"name": "activation_370", "class_name": "Activation", "config": {"name": "activation_370", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_371", 0, 0, {}]]]}, {"name": "conv2d_372", "class_name": "Conv2D", "config": {"name": "conv2d_372", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_370", 0, 0, {}]]]}, {"name": "batch_normalization_372", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_372", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_372", 0, 0, {}]]]}, {"name": "add_179", "class_name": "Add", "config": {"name": "add_179", "trainable": true}, "inbound_nodes": [[["batch_normalization_372", 0, 0, {}], ["activation_369", 0, 0, {}]]]}, {"name": "activation_371", "class_name": "Activation", "config": {"name": "activation_371", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_179", 0, 0, {}]]]}, {"name": "conv2d_373", "class_name": "Conv2D", "config": {"name": "conv2d_373", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_371", 0, 0, {}]]]}, {"name": "batch_normalization_373", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_373", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_373", 0, 0, {}]]]}, {"name": "activation_372", "class_name": "Activation", "config": {"name": "activation_372", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_373", 0, 0, {}]]]}, {"name": "conv2d_374", "class_name": "Conv2D", "config": {"name": "conv2d_374", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_372", 0, 0, {}]]]}, {"name": "batch_normalization_374", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_374", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_374", 0, 0, {}]]]}, {"name": "add_180", "class_name": "Add", "config": {"name": "add_180", "trainable": true}, "inbound_nodes": [[["batch_normalization_374", 0, 0, {}], ["activation_371", 0, 0, {}]]]}, {"name": "activation_373", "class_name": "Activation", "config": {"name": "activation_373", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_180", 0, 0, {}]]]}, {"name": "conv2d_375", "class_name": "Conv2D", "config": {"name": "conv2d_375", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1,